Autodesk.Revit.DB.Electrical.ElectricalSetting.GetCircuitNamingSchemeSettings(Autodesk.Revit.DB.Document)
Gets the circuit naming scheme settings of the project.
cda:
The document.
Returns:
The circuit naming scheme settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021